app/views/users/show.html.erb

SELECT "summit_completions".* FROM "summit_completions" WHERE "summit_completions"."user_id" = ?  [["user_id", 2]]
---
          </tr>
          <% @user.summit_completions.order(@sort_string).each do |summit| %>