app/controllers/indexed_activities_controller.rb

SELECT "indexed_activities".* FROM "indexed_activities"
---
  def index
    @indexed_activities = IndexedActivity.all

INSERT INTO "indexed_activities" ("userId", "activityId", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["userId", 666], ["activityId", 12345], ["created_at", "2016-06-08 20:57:08.282385"], ["updated_at", "2016-06-08 20:57:08.282385"]]
---
  def create
    @indexed_activity = IndexedActivity.new(indexed_activity_params)

    respond_to do |format|
      if @indexed_activity.save

SELECT  "indexed_activities".* FROM "indexed_activities" WHERE "indexed_activities"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_indexed_activity
      @indexed_activity = IndexedActivity.find(params[:id])