app/controllers/summit_completions_controller.rb

SELECT "summit_completions".* FROM "summit_completions"
---
  def index
    @summit_completions = SummitCompletion.all