app/controllers/users_controller.rb

  def connect
    client_id = "3764"
    client_secret = "e0b897e6bc461b774c73fbff6936f656d2e376f3"
    code = params[:code]

    post_params = {'client_id' => client_id, 'client_secret' => client_secret, 'code' => code}
    response = Net::HTTP.post_form(URI.parse('https://www.strava.com/oauth/token'), post_params)

    strava_response = JSON.parse response.body

    current_user.token = strava_response['access_token']
    @result = current_user.save
---
UPDATE "users" SET "token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["token", "cef80412c4e6894a8caa3f847e5fc48168baa0dc"], ["updated_at", "2016-06-06 00:28:27.271588"], ["id", 2]]

  def show

    FindPeaksJob.perform_later current_user.id

    @user = User.find(params[:id])
    unless @user == current_user
      redirect_to :back, :alert => "Access denied."
    end

    if @user.token.nil?
      return #redirect_to action: "connect", :alert => "Please Connect to Strava."
    end

   @summits = @user.summit_completions
   @activities = StravaHelper.all_activities(@user.token)
   @indexed_activities = IndexedActivity.where(user_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "summit_completions".* FROM "summit_completions" WHERE "summit_completions"."user_id" = ?  [["user_id", 2]]